In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
data = pd.read_json('F:/利用Python进行数据分析数据集/examples/example.json')

In [4]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
tables = pd.read_html('F:/利用Python进行数据分析数据集/examples/fdic_failed_bank_list.html')

In [6]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [12]:
import lxml
import html5lib

In [14]:
len(tables)

1

In [15]:
failures = tables[0]

In [16]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [17]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [18]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [19]:
from lxml import objectify

In [22]:
path = 'F:/利用Python进行数据分析数据集/datasets/mta_perf/Performance_MNR.xml'

In [25]:
parsed = objectify.parse(open(path))

In [26]:
root = parsed.getroot()

In [27]:
root

In [28]:
data = []

In [29]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']

In [30]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [31]:
el_data

{'AGENCY_NAME': 'Metro-North Railroad',
 'INDICATOR_NAME': 'Escalator Availability',
 'DESCRIPTION': 'Percent of the time that escalators are operational systemwide. The availability rate is based on physical observations performed the morning of regular business days only. This is a new indicator the agency began reporting in 2009.',
 'PERIOD_YEAR': 2011,
 'PERIOD_MONTH': 12,
 'CATEGORY': 'Service Indicators',
 'FREQUENCY': 'M',
 'INDICATOR_UNIT': '%',
 'YTD_TARGET': 97.0,
 'YTD_ACTUAL': '',
 'MONTHLY_TARGET': 97.0,
 'MONTHLY_ACTUAL': ''}

In [32]:
perf = pd.DataFrame(data)

In [33]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [34]:
root

In [35]:
root.get('href')

In [36]:
from io import StringIO

In [37]:
tag = '<a herf="http://www.google.com">Google</a>'

In [38]:
tag

'<a herf="http://www.google.com">Google</a>'

In [40]:
root = objectify.parse(StringIO(tag)).getroot()

In [41]:
root

In [42]:
root.get('herf')

'http://www.google.com'

In [44]:
root.text

'Google'

In [45]:
frame = pd.read_csv('F:/利用Python进行数据分析数据集/examples/ex1.csv')

In [46]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [47]:
frame.to_pickle('F:/利用Python进行数据分析数据集/examples/pickle')

In [48]:
pd.read_pickle('F:/利用Python进行数据分析数据集/examples/pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [49]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [50]:
frame

           a
0   1.867870
1  -0.776393
2  -0.610066
3  -0.106936
4   1.425838
..       ...
95  1.016898
96  0.158186
97  1.236693
98  0.074327
99  1.966694

[100 rows x 1 columns]

In [51]:
store = pd.HDFStore('mydata.h5')

In [52]:
store['obj1'] = frame

In [53]:
store['obj1_col'] = frame['a']

In [54]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [55]:
store['obj1']

           a
0   1.867870
1  -0.776393
2  -0.610066
3  -0.106936
4   1.425838
..       ...
95  1.016898
96  0.158186
97  1.236693
98  0.074327
99  1.966694

[100 rows x 1 columns]

In [56]:
store.put('obj2',frame,format = 'table')

In [57]:
store.select('obj2',where = ['index>=10 and index<=15'])

           a
10 -0.133006
11  0.120790
12  0.662687
13 -0.090964
14 -1.176926
15 -1.132294

In [59]:
frame.to_hdf('mydata.h5','obj3',format = 'table')

In [62]:
pd.read_hdf('mydata.h5','obj3',where= ['index<5'])

ValueError: The file 'mydata.h5' is already opened, but not in read-only mode (as requested).